yamamo2shun1/OTO_DEVICES/STM32CubeIDE/JUMBLEQ/Appli/Core/Src/usb_descriptors.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2020 Ha Thach (tinyusb.org)
 * Copyright (c) 2020 Jerzy Kasenberg
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 *
 */
#include "stm32h7rsxx_hal.h"
#include "tusb.h"
#include "usb_descriptors.h"
#include "app_version.h"

#include <stdio.h>

#define USB_PID 0x0011

// String Descriptor Index
enum
{
    STRID_LANGID = 0,
    STRID_MANUFACTURER,
    STRID_PRODUCT,
    STRID_SERIAL,

    // Keep these indices aligned with string_desc_arr[] below
    STRID_AUDIO,
    STRID_AUDIO_OUT,
    STRID_AUDIO_IN,
#if CFG_TUD_MIDI
    STRID_MIDI,
#endif
};

//--------------------------------------------------------------------+
// Device Descriptors
//--------------------------------------------------------------------+
static tusb_desc_device_t const desc_device =
    {
        .bLength         = sizeof(tusb_desc_device_t),
        .bDescriptorType = TUSB_DESC_DEVICE,
        .bcdUSB          = 0x0200,

        // Use Interface Association Descriptor (IAD) for Audio
        // As required by USB Specs IAD's subclass must be common class (2) and protocol must be IAD (1)
        .bDeviceClass    = TUSB_CLASS_MISC,
        .bDeviceSubClass = MISC_SUBCLASS_COMMON,
        .bDeviceProtocol = MISC_PROTOCOL_IAD,
        .bMaxPacketSize0 = CFG_TUD_ENDPOINT0_SIZE,

        .idVendor  = 0x31BF,
        .idProduct = USB_PID,
        .bcdDevice = APP_VERSION_USB_BCD,

        .iManufacturer = 0x01,
        .iProduct      = 0x02,
        .iSerialNumber = 0x03,

        .bNumConfigurations = 0x01};

// Invoked when received GET DEVICE DESCRIPTOR
// Application return pointer to descriptor
uint8_t const* tud_descriptor_device_cb(void)
{
    return (uint8_t const*) &desc_device;
}

//--------------------------------------------------------------------+
// Configuration Descriptor
//--------------------------------------------------------------------+
#if CFG_TUSB_MCU == OPT_MCU_LPC175X_6X || CFG_TUSB_MCU == OPT_MCU_LPC177X_8X || CFG_TUSB_MCU == OPT_MCU_LPC40XX
    // LPC 17xx and 40xx endpoint type (bulk/interrupt/iso) are fixed by its number
    // 0 control, 1 In, 2 Bulk, 3 Iso, 4 In etc ...
    #define EPNUM_AUDIO_OUT 0x03
    #define EPNUM_AUDIO_FB  0x04
    #define EPNUM_AUDIO_INT 0x01
    #define EPNUM_AUDIO_IN  0x05

#elif CFG_TUSB_MCU == OPT_MCU_CXD56
    // CXD56 USB driver has fixed endpoint type (bulk/interrupt/iso) and direction (IN/OUT) by its number
    // 0 control (IN/OUT), 1 Bulk (IN), 2 Bulk (OUT), 3 In (IN), 4 Bulk (IN), 5 Bulk (OUT), 6 In (IN)
    #define EPNUM_AUDIO_OUT 0x02
    #define EPNUM_AUDIO_FB  0x03
    #define EPNUM_AUDIO_INT 0x03
    #define EPNUM_AUDIO_IN  0x01

#elif CFG_TUSB_MCU == OPT_MCU_NRF5X
    // ISO endpoints for NRF5x are fixed to 0x08 (0x88)
    #define EPNUM_AUDIO_OUT 0x08
    #define EPNUM_AUDIO_FB  0x01
    #define EPNUM_AUDIO_INT 0x02
    #define EPNUM_AUDIO_IN  0x08

#elif defined(TUD_ENDPOINT_ONE_DIRECTION_ONLY)
    // MCUs that don't support a same endpoint number with different direction IN and OUT defined in tusb_mcu.h
    //    e.g EP1 OUT & EP1 IN cannot exist together
    #define EPNUM_AUDIO_OUT 0x02
    #define EPNUM_AUDIO_FB  0x06
    #define EPNUM_AUDIO_INT 0x03
    #define EPNUM_AUDIO_IN  0x01

#else
    #define EPNUM_AUDIO_OUT 0x01
    #define EPNUM_AUDIO_FB  0x03
    #define EPNUM_AUDIO_INT 0x02
    #define EPNUM_AUDIO_IN  0x04
#endif

#if CFG_TUD_MIDI
    // MIDI uses Bulk endpoints. Pick endpoint numbers that don't overlap with audio.
    // Note: some MCUs cannot use same endpoint number for IN and OUT (TUD_ENDPOINT_ONE_DIRECTION_ONLY).
    #if defined(TUD_ENDPOINT_ONE_DIRECTION_ONLY)
        #define EPNUM_MIDI_OUT 0x07
        #define EPNUM_MIDI_IN  0x08
    #else
        #define EPNUM_MIDI_OUT 0x06
        #define EPNUM_MIDI_IN  0x06
    #endif

    // MIDI Bulk max packet size depends on speed: FS=64, HS=512.
    #define MIDI_EP_SIZE_FS 64
    #define MIDI_EP_SIZE_HS 512
#endif

#define CONFIG_UAC2_TOTAL_LEN (TUD_CONFIG_DESC_LEN + TUD_AUDIO20_DUPLEX_DESC_LEN + (CFG_TUD_MIDI ? TUD_MIDI_DESC_LEN : 0))

uint8_t const desc_uac2_configuration[] =
    {
        // Config number, interface count, string index, total length, attribute, power in mA
        TUD_CONFIG_DESCRIPTOR(1, ITF_NUM_TOTAL, 0, CONFIG_UAC2_TOTAL_LEN, 0x00, 500),

        // One UAC2 function: Speaker OUT and Mic IN share a clock source.
        TUD_AUDIO20_DUPLEX_DESCRIPTOR(ITF_NUM_AUDIO_CONTROL, ITF_NUM_AUDIO_STREAMING_STEREO_OUT, ITF_NUM_AUDIO_STREAMING_STEREO_IN,
                                      STRID_AUDIO, STRID_AUDIO_OUT, STRID_AUDIO_IN,
                                      EPNUM_AUDIO_OUT, EPNUM_AUDIO_FB | 0x80, EPNUM_AUDIO_IN | 0x80, EPNUM_AUDIO_INT | 0x80),

#if CFG_TUD_MIDI

        // MIDI (Audio Class 1.0, MIDIStreaming)
        TUD_MIDI_DESCRIPTOR(ITF_NUM_MIDI, STRID_MIDI, EPNUM_MIDI_OUT, (uint8_t) (EPNUM_MIDI_IN | 0x80), MIDI_EP_SIZE_HS),

#endif
};

TU_VERIFY_STATIC(sizeof(desc_uac2_configuration) == CONFIG_UAC2_TOTAL_LEN, "Incorrect size");

#if TUD_OPT_HIGH_SPEED

// device qualifier is mostly similar to device descriptor since we don't change configuration based on speed
tusb_desc_device_qualifier_t const desc_device_qualifier =
    {
        .bLength         = sizeof(tusb_desc_device_qualifier_t),
        .bDescriptorType = TUSB_DESC_DEVICE_QUALIFIER,
        .bcdUSB          = 0x0200,

        .bDeviceClass    = TUSB_CLASS_MISC,
        .bDeviceSubClass = MISC_SUBCLASS_COMMON,
        .bDeviceProtocol = MISC_PROTOCOL_IAD,

        .bMaxPacketSize0    = CFG_TUD_ENDPOINT0_SIZE,
        .bNumConfigurations = 0x01,
        .bReserved          = 0x00};

// Invoked when received GET DEVICE QUALIFIER DESCRIPTOR request
// Application return pointer to descriptor, whose contents must exist long enough for transfer to complete.
// device_qualifier descriptor describes information about a high-speed capable device that would
// change if the device were operating at the other speed. If not highspeed capable stall this request.
uint8_t const* tud_descriptor_device_qualifier_cb(void)
{
    return (uint8_t const*) &desc_device_qualifier;
}

// Invoked when received GET OTHER SEED CONFIGURATION DESCRIPTOR request
// Application return pointer to descriptor, whose contents must exist long enough for transfer to complete
// Configuration descriptor in the other speed e.g if high speed then this is for full speed and vice versa
uint8_t const* tud_descriptor_other_speed_configuration_cb(uint8_t index)
{
    (void) index;  // for multiple configurations

    // UAC2-only: use the same descriptor regardless of requested opposite speed.
    return desc_uac2_configuration;
}
#endif

// Invoked when received GET CONFIGURATION DESCRIPTOR
// Application return pointer to descriptor
// Descriptor contents must exist long enough for transfer to complete
uint8_t const* tud_descriptor_configuration_cb(uint8_t index)
{
    (void) index;  // for multiple configurations
    return desc_uac2_configuration;
}

//--------------------------------------------------------------------+
// String Descriptors
//--------------------------------------------------------------------+

// array of pointer to string descriptors
static char const* string_desc_arr[] =
    {
        (const char[]) {0x09, 0x04}, // 0: is supported language is English (0x0409)
        "Yamamoto Works Ltd.", // 1: Manufacturer
        "JUMBLEQ", // 2: Product
        NULL, // 3: Serials will use unique ID if possible
        "JUMBLEQ Audio", // 4: Function
        "JUMBLEQ Audio OUT", // 5: Streaming interface
        "JUMBLEQ Audio IN", // 6: Streaming interface
#if CFG_TUD_MIDI
        "JUMBLEQ MIDI", // 7: Function
#endif
};

static uint16_t _desc_str[32 + 1];

// Invoked when received GET STRING DESCRIPTOR request
// Application return pointer to descriptor, whose contents must exist long enough for transfer to complete
uint16_t const* tud_descriptor_string_cb(uint8_t index, uint16_t langid)
{
    (void) langid;
    size_t chr_count;

    switch (index)
    {
    case STRID_LANGID:
        memcpy(&_desc_str[1], string_desc_arr[0], 2);
        chr_count = 1;
        break;

    case STRID_SERIAL:
        char sstr[30] = "";
        sprintf(sstr, "%X-%X-%X", HAL_GetUIDw0(), HAL_GetUIDw1(), HAL_GetUIDw2());
        chr_count = (uint8_t) strlen(sstr);
        if (chr_count > 31)
        {
            chr_count = 31;
        }

        // Convert ASCII string into UTF-16
        for (uint8_t i = 0; i < chr_count; i++)
        {
            _desc_str[1 + i] = sstr[i];
        }
        break;

    default:
        // Note: the 0xEE index string is a Microsoft OS 1.0 Descriptors.
        // https://docs.microsoft.com/en-us/windows-hardware/drivers/usbcon/microsoft-defined-usb-descriptors

        if (!(index < sizeof(string_desc_arr) / sizeof(string_desc_arr[0])))
            return NULL;

        const char* str = string_desc_arr[index];

        // Cap at max char
        chr_count              = strlen(str);
        size_t const max_count = sizeof(_desc_str) / sizeof(_desc_str[0]) - 1;  // -1 for string type
        if (chr_count > max_count)
            chr_count = max_count;

        // Convert ASCII string into UTF-16
        for (size_t i = 0; i < chr_count; i++)
        {
            _desc_str[1 + i] = str[i];
        }
        break;
    }

    // first byte is length (including header), second byte is string type
    _desc_str[0] = (uint16_t) ((TUSB_DESC_STRING << 8) | (2 * chr_count + 2));

    return _desc_str;
}
